#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
google_iam_workload_identity_pool.my-wif-pool: Refreshing state... [id=projects/workload-idenity-federation/locations/global/workloadIdentityPools/my-wif-pool]
data.google_monitoring_notification_channel.gcs_unknown_access_notify_channel: Reading...
data.google_service_account.terraform-sa: Reading...
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/iamcredentials.googleapis.com]
google_project_service.enable_api["sts.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/sts.googleapis.com]
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/iam.googleapis.com]
google_project_iam_audit_config.storage_logging: Refreshing state... [id=workload-idenity-federation/audit_config/storage.googleapis.com]
google_project_service.enable_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/cloudresourcemanager.googleapis.com]
google_storage_bucket.test001: Refreshing state... [id=workload-idenity-federation-bucket-test001]
google_project_service.enable_api["storage.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/storage.googleapis.com]
data.google_service_account.terraform-sa: Read complete after 0s [id=projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/storage.admin"]: Refreshing state... [id=workload-idenity-federation/roles/storage.admin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/iam.serviceAccountViewer"]: Refreshing state... [id=workload-idenity-federation/roles/iam.serviceAccountViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=workload-idenity-federation/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
data.google_monitoring_notification_channel.gcs_unknown_access_notify_channel: Read complete after 0s [id=projects/workload-idenity-federation/notificationChannels/10801203138166902837]
google_project_iam_member.terraform_sa_role["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=workload-idenity-federation/roles/resourcemanager.projectIamAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/serviceusage.serviceUsageViewer"]: Refreshing state... [id=workload-idenity-federation/roles/serviceusage.serviceUsageViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.my-wif-provider: Refreshing state... [id=projects/workload-idenity-federation/locations/global/workloadIdentityPools/my-wif-pool/providers/my-wif-provider]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/524220704155/locations/global/workloadIdentityPools/my-wif-pool/attribute.repository/nevenisnoob/WorkloadIdentityFederation]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_monitoring_alert_policy.alert_gcs_with_call_ip will be created
  + resource "google_monitoring_alert_policy" "alert_gcs_with_call_ip" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "GCS Caller IP Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/workload-idenity-federation/notificationChannels/10801203138166902837",
        ]
      + project               = "workload-idenity-federation"

      + alert_strategy {
          + auto_close = "604800s"

          + notification_rate_limit {
              + period = "86400s"
            }
        }

      + conditions {
          + display_name = "GCS Caller IP Alert"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=gcs_bucket AND (protoPayload.authorizationInfo.permission = \"storage.objects.get\" OR protoPayload.authorizationInfo.permission = \"storage.objects.update\" OR protoPayload.authorizationInfo.permission = \"storage.objects.create\" OR protoPayload.authorizationInfo.permission = \"storage.objects.delete\") AND NOT (ip_in_net(protoPayload.requestMetadata.callerIp, \"10.236.41.187/32\"))"
            }
        }
    }

  # google_project_iam_audit_config.enable_gcs_logging will be created
  + resource "google_project_iam_audit_config" "enable_gcs_logging" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + project = "workload-idenity-federation"
      + service = "storage.googleapis.com"

      + audit_log_config {
          + exempted_members = []
          + log_type         = "DATA_READ"
        }
      + audit_log_config {
          + exempted_members = []
          + log_type         = "DATA_WRITE"
        }
    }

  # google_project_iam_custom_role.terraform-ci will be created
  + resource "google_project_iam_custom_role" "terraform-ci" {
      + deleted     = (known after apply)
      + description = "TerraformCIのCustomRole"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "resourcemanager.projects.getIamPolicy",
        ]
      + project     = (known after apply)
      + role_id     = "TerraformCI"
      + title       = "Terraform CI Custom Role"
    }

  # google_project_iam_member.terraform-role will be created
  + resource "google_project_iam_member" "terraform-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com"
      + project = "workload-idenity-federation"
      + role    = "roles/monitoring.editor"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @nevenisnoob, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*